#include <stdio.h>
#include <process.h>

// c++11

// "用户目录"
// <系统目录>

int main()
{
    //std::cout << "1*1=1,1*2=2,1*3=3,1*4=4,1*5=5,1*6=6,1*7=7,1*8=8,1*9=9," << std::endl;
    //std::cout << "2*1=2,2*2=2,2*3=3,2*4=4,2*5=5,2*6=6,2*7=7,2*8=8,2*9=9," << std::endl;
    //std::cout << "3*1=3,3*2=2,3*3=3,3*4=4,3*5=5,3*6=6,3*7=7,3*8=8,3*9=9," << std::endl;
    //std::cout << "4*1=4,4*2=2,4*3=3,4*4=4,4*5=5,4*6=6,4*7=7,4*8=8,4*9=9," << std::endl;
    //std::cout << "5*1=5,5*2=2,5*3=3,5*4=4,5*5=5,5*6=6,5*7=7,5*8=8,5*9=9," << std::endl;
    //std::cout << "6*1=6,6*2=2,6*3=3,6*4=4,6*5=5,6*6=6,6*7=7,6*8=8,6*9=9," << std::endl;
    //std::cout << "7*1=7,7*2=2,7*3=3,7*4=4,7*5=5,7*6=6,7*7=7,7*8=8,7*9=9," << std::endl;
    //std::cout << "8*1=8,8*2=2,8*3=3,8*4=4,8*5=5,8*6=6,8*7=7,8*8=8,8*9=9," << std::endl;
    //std::cout << "9*1=9,9*2=2,9*3=3,9*4=4,9*5=5,9*6=6,9*7=7,9*8=8,9*9=9," << std::endl;

    // ->->->面向过程
    //1 顺序执行


    //3 循环执行

    //int a;// DWORD
    //int b;








    //a = 1;
    //a = 2;
    //a = 3;
    //a = 4;
    //a = 5;


    //true;
    //false;      // 非零即真


    //a = a - 2;
    //a -= 2;

    //"a += 1;" == "a = a + 1;"
    // 自增
    // 自减
    //a++; a += 1; a = a + 1;
    //b--;

    // 作用域
    for (int a = 1; a < 10; a++)
    {
        for (int b = 1; b <= a; b++)
        {
            printf("%d*%d=%d\t", b, a, b*a);
        }
        printf("\n");
    }


    for (int a = 1; a < 10; a++)
    {
        for (int b = a; b > 0; b--)
        {
            printf("%d*%d=%d\t", b, a, b*a);
        }
        printf("\n");
    }

    //{
    //    b = 1;
    //    std::cout << a << '*' << b << '=' << a*b << ',';
    //    b = 2;
    //    std::cout << a << '*' << b << '=' << a*b << ',';
    //    std::cout << ".....";
    //    b = 9;
    //    std::cout << a << '*' << b << '=' << a*b << ',';
    //    std::cout << std::endl;
    //}




    //a = 2;
    //b = 1;
    //std::cout << a << '*' << b << '=' << a*b << ',';
    //b = 2;
    //std::cout << a << '*' << b << '=' << a*b << ',';
    //std::cout << ".....";
    //b = 9;
    //std::cout << a << '*' << b << '=' << a*b << ',';
    //std::cout << std::endl;





    //a = 3;
    //b = 1;
    //std::cout << a << '*' << b << '=' << a*b << ',';
    //b = 2;
    //std::cout << a << '*' << b << '=' << a*b << ',';
    //std::cout << ".....";
    //b = 9;
    //std::cout << a << '*' << b << '=' << a*b << ',';
    //std::cout << std::endl;





    // std::cout << a << std::endl;
    // std::cout << b << std::endl;










    system("Pause");
    return 0;
}

